% 绘制圓柱 參數：繪圖位置P，圓柱姿態矩陣R
function DrawCylinder(P, R)
    r=0.2;%圆柱半径
    n=50;%设置多少个边逼近圆
    [x,y,z]=cylinder(r,n);%生成标准的100个面的圆柱数据，半径为r，高为1，底面圆心0，0；
    z=[z(1,:)-0.5;z(2,:)-0.5];%圆柱高增高，变为高h
    for k=1:n+1
        xx1 = R(1,1)*x(1,k)+R(1,2)*y(1,k)+R(1,3)*z(1,k)+P(1);
        yy1 = R(2,1)*x(1,k)+R(2,2)*y(1,k)+R(2,3)*z(1,k)+P(2);
        zz1 = R(3,1)*x(1,k)+R(3,2)*y(1,k)+R(3,3)*z(1,k)+P(3);
        xx2 = R(1,1)*x(2,k)+R(1,2)*y(2,k)+R(1,3)*z(2,k)+P(1);
        yy2 = R(2,1)*x(2,k)+R(2,2)*y(2,k)+R(2,3)*z(2,k)+P(2);
        zz2 = R(3,1)*x(2,k)+R(3,2)*y(2,k)+R(3,3)*z(2,k)+P(3);
        x(1,k) =  xx1; x(2,k) =  xx2;
        y(1,k) =  zz1; y(2,k) =  zz2;
        z(1,k) =  yy1; z(2,k) =  yy2;
    end
    %为变成实心封顶添加数据
    z2=[z(1,:);z;z(2,:)];
    x2=[x(1,:);x;x(2,:)];
    y2=[y(1,:);y;y(2,:)];

    z3=[z(1,:);z(1,:)];
    x3=[x(1,:);x(1,:)];
    y3=[y(1,:);y(1,:)];
    
    z4=[z(2,:);z(2,:)];
    x4=[x(2,:);x(2,:)];
    y4=[y(2,:);y(2,:)];
    
    surf(x2,z2,y2,'LineStyle','none')
    map=jet(16);
    cl=4;%可设置16种颜色(1-16)
    colormap(map(cl,:))
    hold on
    surf(x3,z3,y3);
    hold on
    surf(x4,z4,y4);
    hold on
end